# Brewfile — Homebrew packages for development environment
# Update with: brew bundle dump --force
# Install with: brew bundle
#
# ╔════════════════════════════════════════════╗
# ║  How to update your Brewfile:              ║
# ║  Run on your current machine:              ║
# ║    bash scripts/dump-brew.sh               ║
# ║  Or manually:                              ║
# ║    brew bundle dump --force                ║
# ╚════════════════════════════════════════════╝

# ── Essential Development Tools ──────────────────────────────────────────────

# mise - Polyglot version manager (Node, Python, Ruby, etc.)
brew "mise"

# Starship - Cross-shell prompt
brew "starship"

# Mole - Mac cleanup and maintenance terminal tool
brew "mole"

# Neovim - Hyperextensible Vim-based text editor
brew "neovim"

# fd - Fast and user-friendly alternative to find (used by snacks.nvim picker)
brew "fd"

# ripgrep - Fast recursive grep (used by snacks.nvim picker for live grep)
brew "ripgrep"

# ── Editors ───────────────────────────────────────────────────────────────────

# Zed - High-performance, multiplayer code editor
cask "zed"

# ── System Info ───────────────────────────────────────────────────────────────

# fastfetch - Fast system information tool (shown on terminal startup)
brew "fastfetch"

# btop - Resource monitor (CPU, memory, disks, network, processes)
brew "btop"

# ── File Management ──────────────────────────────────────────────────────────

# superfile - Pretty, modern terminal file manager
brew "superfile"

# ── Terminal ──────────────────────────────────────────────────────────────────

# cmux - Terminal multiplexer built on top of Ghostty
cask "cmux"

# tmux - Terminal multiplexer for session management
brew "tmux"

# ── Window Management ─────────────────────────────────────────────────────────

# Aerospace - i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-maple-mono-nf"

# ── AI / Local LLMs ───────────────────────────────────────────────────────────

# Ollama - Run local LLMs (models stored at ~/.ollama/models, not in dotfiles)
brew "ollama"

# ── Networking / VPN ──────────────────────────────────────────────────────────

# Cloudflare WARP - VPN client
cask "cloudflare-warp"
