# Brewfile — Homebrew packages for development environment
# Update with: brew bundle dump --force
# Install with: brew bundle

# ── Essential Development Tools ──────────────────────────────────────────────

# mise - Polyglot version manager (Node, Python, Ruby, etc.)
brew "mise"

# Starship - Cross-shell prompt
brew "starship"

# Mole - Mac cleanup and maintenance terminal tool
brew "mole"

# Neovim - Hyperextensible Vim-based text editor
brew "neovim"

# fd - Fast and user-friendly alternative to find (used by snacks.nvim picker)
brew "fd"

# ripgrep - Fast recursive grep (used by snacks.nvim picker for live grep)
brew "ripgrep"


# ── System Info ───────────────────────────────────────────────────────────────

# fastfetch - Fast system information tool (shown on terminal startup)
brew "fastfetch"

# btop - Resource monitor (CPU, memory, disks, network, processes)
brew "btop"

# ── File Management ──────────────────────────────────────────────────────────

# superfile - Pretty, modern terminal file manager
brew "superfile"

# ── Git ───────────────────────────────────────────────────────────────────────

# GitHub CLI - Interact with GitHub from the command line
brew "gh"

# lazygit - Terminal UI for git; usable standalone or inside Neovim (<leader>gg)
brew "lazygit"

# ── Dotfiles ──────────────────────────────────────────────────────────────────

# Stow - Symlink manager used by sync.sh to link all packages to $HOME
brew "stow"

# ── Terminal ──────────────────────────────────────────────────────────────────

# Ghostty - GPU-accelerated terminal emulator (default terminal)
cask "ghostty"

# herdr - The agent multiplexer that lives in your terminal
brew "herdr"

# ── Window Management ─────────────────────────────────────────────────────────

# Aerospace - i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"

# Hammerspoon - macOS automation via Lua
cask "hammerspoon"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-maple-mono-nf"

# ── AI / Local LLMs ───────────────────────────────────────────────────────────

# Ollama - Run local LLMs (models stored at ~/.ollama/models, not in dotfiles)
brew "ollama"

# ── AI Coding Agents ──────────────────────────────────────────────────────────

# Claude Code - Anthropic's terminal-based AI coding assistant
cask "claude-code"

# Codex - OpenAI's terminal-based coding agent
cask "codex"

# ── Networking / VPN ──────────────────────────────────────────────────────────

# Cloudflare WARP - VPN client
cask "cloudflare-warp"
